<?php
header("Content-type: text/html; charset=utf-8");
	/* echo '[{
    "城市代码": [
        {
            "省": "直辖市",
            "市": [{"市名": "北京市",
						"县": [{"县名":"东城区","镇":["aa","dd"]},{"县名":"西城区","镇":["aa","dd"]},{"县名":"崇文区","镇":["aa","dd"]},{"县名":"宣武区","镇":["aa","dd"]},{"县名":"朝阳区","镇":["aa","dd"]},{"县名":"丰台区","镇":["aa","dd"]},{"县名":"石景山区","镇":["aa","dd"]},{"县名":"海淀区","镇":["aa","dd"]},{"县名":"门头沟区","镇":["aa","dd"]},{"县名":"通州区"},{"县名":"顺义区","镇":["aa","dd"]},{"县名":"昌平区","镇":["aa","dd"]},{"县名":"大兴区","镇":["aa","dd"]},{"县名":"平谷区","镇":["aa","dd"]},{"县名":"怀柔区","镇":["aa","dd"]},{"县名":"密云","镇":["aa","dd"]},{"县名":"延庆","镇":["aa","dd"]}]},
					{"市名": "天津市","县": [{"县名":"和平区","镇":["aa","dd"]},{"县名":"河东区","镇":["aa","dd"]},{"县名":"河西区","镇":["aa","dd"]},{"县名":"南开区","镇":["aa","dd"]},{"县名":"河北区","镇":["aa","dd"]},{"县名":"红桥区","镇":["aa","dd"]},{"县名":"塘沽区","镇":["aa","dd"]},{"县名":"汉沽区","镇":["aa","dd"]},{"县名":"大港区","镇":["aa","dd"]},{"县名":"东丽区","镇":["aa","dd"]},{"县名":"西青区","镇":["aa","dd"]},{"县名":"津南区","镇":["aa","dd"]},{"县名":"北辰区","镇":["aa","dd"]},{"县名":"武清区","镇":["aa","dd"]},{"县名":"宝坻区","镇":["aa","dd"]},{"县名":"宁河","镇":["aa","dd"]},{"县名":"静海","镇":["aa","dd"]},{"县名":"蓟  ","镇":["aa","dd"]}
					]},
					{"市名": "上海","县":[{"县名":"黄浦区","镇":["aa","dd"]},{"县名":"卢湾区","镇":["aa","dd"]},{"县名":"徐汇区","镇":["aa","dd"]},{"县名":"长宁区","镇":["aa","dd"]},{"县名":"静安区","镇":["aa","dd"]},{"县名":"普陀区","镇":["aa","dd"]},{"县名":"闸北区","镇":["aa","dd"]},{"县名":"虹口区","镇":["aa","dd"]},{"县名":"杨浦区","镇":["aa","dd"]},{"县名":"宝山区","镇":["aa","dd"]},{"县名":"闵行区","镇":["aa","dd"]},{"县名":"嘉定区","镇":["aa","dd"]},{"县名":"松江区","镇":["aa","dd"]},{"县名":"金山区","镇":["aa","dd"]},{"县名":"青浦区","镇":["aa","dd"]},{"县名":"南汇区","镇":["aa","dd"]},{"县名":"奉贤区","镇":["aa","dd"]},{"县名":"浦东新区","镇":["aa","dd"]},{"县名":"崇明","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]},
					{
						"市名": "重庆",
						"县":[{"县名":"渝中区","镇":["aa","dd"]},{"县名":"大渡口区","镇":["aa","dd"]},{"县名":"江北区","镇":["aa","dd"]},{"县名":"南岸区","镇":["aa","dd"]},{"县名":"北碚区","镇":["aa","dd"]},{"县名":"渝北区","镇":["aa","dd"]},{"县名":"巴南区","镇":["aa","dd"]},{"县名":"长寿区","镇":["aa","dd"]},{"县名":"双桥区","镇":["aa","dd"]},{"县名":"沙坪坝区","镇":["aa","dd"]},{"县名":"万盛区","镇":["aa","dd"]},{"县名":"万州区","镇":["aa","dd"]},{"县名":"涪陵区","镇":["aa","dd"]},{"县名":"黔江区","镇":["aa","dd"]},{"县名":"永川区","镇":["aa","dd"]},{"县名":"合川区","镇":["aa","dd"]},{"县名":"江津区","镇":["aa","dd"]},{"县名":"九龙坡区","镇":["aa","dd"]},{"县名":"南川区","镇":["aa","dd"]},{"县名":"綦江","镇":["aa","dd"]},{"县名":"潼南","镇":["aa","dd"]},{"县名":"荣昌","镇":["aa","dd"]},{"县名":"璧山","镇":["aa","dd"]},{"县名":"大足","镇":["aa","dd"]},{"县名":"铜梁","镇":["aa","dd"]},{"县名":"梁平","镇":["aa","dd"]},{"县名":"开","镇":["aa","dd"]},{"县名":"忠","镇":["aa","dd"]},{"县名":"城口","镇":["aa","dd"]},{"县名":"垫江","镇":["aa","dd"]},{"县名":"武隆","镇":["aa","dd"]},{"县名":"丰都","镇":["aa","dd"]},{"县名":"奉节","镇":["aa","dd"]},{"县名":"云阳","镇":["aa","dd"]},{"县名":"巫溪","镇":["aa","dd"]},{"县名":"巫山","镇":["aa","dd"]},{"县名":"石柱土家族自治","镇":["aa","dd"]},{"县名":"秀山土家族苗族自治","镇":["aa","dd"]},{"县名":"酉阳土家族苗族自治","镇":["aa","dd"]},{"县名":"彭水苗族土家族自治","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
					}
				
				]
        },
        {
            "省": "陕西省",
            "市": [
                {
                    "市名": "西安",
                    "县": [{"县名":"莲湖区","镇":["aa","dd"]},{"县名":"新城区","镇":["aa","dd"]},{"县名":"碑林区","镇":["aa","dd"]},{"县名":"雁塔区","镇":["aa","dd"]},{"县名":"灞桥区","镇":["aa","dd"]},{"县名":"未央区","镇":["aa","dd"]},{"县名":"阎良区","镇":["aa","dd"]},{"县名":"临潼区","镇":["aa","dd"]},{"县名":"长安区","镇":["aa","dd"]},{"县名":"高陵","镇":["aa","dd"]},{"县名":"蓝田","镇":["aa","dd"]},{"县名":"户","镇":["aa","dd"]},{"县名":"周至","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                },
                {
                    "市名": "延安",
                    "县": [{"县名":"宝塔区","镇":["aa","dd"]},{"县名":"安塞","镇":["aa","dd"]},{"县名":"洛川","镇":["aa","dd"]},{"县名":"子长","镇":["aa","dd"]},{"县名":"黄陵","镇":["aa","dd"]},{"县名":"延川","镇":["aa","dd"]},{"县名":"富","镇":["aa","dd"]},{"县名":"延长","镇":["aa","dd"]},{"县名":"甘泉","镇":["aa","dd"]},{"县名":"宜川","镇":["aa","dd"]},{"县名":"志丹","镇":["aa","dd"]},{"县名":"黄龙","镇":["aa","dd"]},{"县名":"吴起","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                },
                {
                    "市名": "铜川",
                    "县": [{"县名":"耀州区","镇":["aa","dd"]},{"县名":"王益区","镇":["aa","dd"]},{"县名":"印台区","镇":["aa","dd"]},{"县名":"宜君","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                }
                ,
                {
                    "市名": "宝鸡",
                    "县": [{"县名":"渭滨区","镇":["aa","dd"]},{"县名":"金台区","镇":["aa","dd"]},{"县名":"陈仓区","镇":["aa","dd"]},{"县名":"岐山","镇":["aa","dd"]},{"县名":"凤翔","镇":["aa","dd"]},{"县名":"陇","镇":["aa","dd"]},{"县名":"太白","镇":["aa","dd"]},{"县名":"麟游","镇":["aa","dd"]},{"县名":"扶风","镇":["aa","dd"]},{"县名":"千阳","镇":["aa","dd"]},{"县名":"眉","镇":["aa","dd"]},{"县名":"凤","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                }
                ,
                {
                    "市名": "咸阳",
                    "县": [{"县名":"秦都区","镇":["aa","dd"]},{"县名":"渭城区","镇":["aa","dd"]},{"县名":"杨陵区","镇":["aa","dd"]},{"县名":"兴平市","镇":["aa","dd"]},{"县名":"礼泉","镇":["aa","dd"]},{"县名":"泾阳","镇":["aa","dd"]},{"县名":"永寿","镇":["aa","dd"]},{"县名":"三原","镇":["aa","dd"]},{"县名":"彬","镇":["aa","dd"]},{"县名":"旬邑","镇":["aa","dd"]},{"县名":"长武","镇":["aa","dd"]},{"县名":"乾","镇":["aa","dd"]},{"县名":"武功","镇":["aa","dd"]},{"县名":"淳化","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                }
                ,
                {
                    "市名": "渭南",
                    "县": [{"县名":"临渭区","镇":["aa","dd"]},{"县名":"韩城市","镇":["aa","dd"]},{"县名":"华阴市","镇":["aa","dd"]},{"县名":"蒲城","镇":["aa","dd"]},{"县名":"潼关","镇":["aa","dd"]},{"县名":"白水","镇":["aa","dd"]},{"县名":"澄城","镇":["aa","dd"]},{"县名":"华","镇":["aa","dd"]},{"县名":"合阳","镇":["aa","dd"]},{"县名":"富平","镇":["aa","dd"]},{"县名":"大荔","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                }
                ,
                {
                    "市名": "汉中",
                    "县": [{"县名":"汉台区","镇":["aa","dd"]},{"县名":"留坝","镇":["aa","dd"]},{"县名":"镇巴","镇":["aa","dd"]},{"县名":"城固","镇":["aa","dd"]},{"县名":"南郑","镇":["aa","dd"]},{"县名":"洋","镇":["aa","dd"]},{"县名":"宁强","镇":["aa","dd"]},{"县名":"佛坪","镇":["aa","dd"]},{"县名":"勉","镇":["aa","dd"]},{"县名":"西乡","镇":["aa","dd"]},{"县名":"略阳","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                }
                ,
                {
                    "市名": "榆林",
                    "县": [{"县名":"榆阳区","镇":["aa","dd"]},{"县名":"清涧","镇":["aa","dd"]},{"县名":"绥德","镇":["aa","dd"]},{"县名":"神木","镇":["aa","dd"]},{"县名":"佳","镇":["aa","dd"]},{"县名":"府谷","镇":["aa","dd"]},{"县名":"子洲","镇":["aa","dd"]},{"县名":"靖边","镇":["aa","dd"]},{"县名":"横山","镇":["aa","dd"]},{"县名":"米脂","镇":["aa","dd"]},{"县名":"吴堡","镇":["aa","dd"]},{"县名":"定边","镇":["aa","dd"]},{"县名":"其他","镇":["aa","dd"]}]
                }
            ]
        }
   ]
}]'*/
	
	//echo $cityObj;
	
	
		echo '[{"name":"陕西省","city":["西安市","咸阳市","渭南市","榆林市","宝鸡市","商洛市","铜川市"]},
				   {"name":"河南省","city":["郑州市","开封市"]}
			  ]'
		
?>